alertas/fixtures/test_subscription.json

[
{
    "model": "alertas.user",
    "pk": 1,
    "fields": {
        "password": "invalid",
        "last_login": "2019-02-19T05:14:02.467Z",
        "is_superuser": false,
        "first_name": "John",
        "last_name": "Lennon",
        "is_staff": false,
        "is_active": true,
        "date_joined": "2019-02-19T03:21:03.978Z",
        "email": "lennon@thebeatles.com",
        "groups": [],
        "user_permissions": []
    }
},
{
    "model": "djstripe.customer",
    "pk": 1,
    "fields": {
        "id": "cus_EYToLi2TfcJ15v",
        "livemode": false,
        "created": "2019-02-19T00:52:41Z",
        "metadata": "{\"djstripe_subscriber\":\"1\"}",
        "description": "John Lennon",
        "djstripe_created": "2019-02-19T00:52:41.770Z",
        "djstripe_updated": "2019-02-19T02:05:12.765Z",
        "account_balance": 0,
        "business_vat_id": "211212121Z",
        "currency": "eur",
        "default_source": null,
        "delinquent": false,
        "coupon": null,
        "coupon_start": null,
        "coupon_end": null,
        "email": "lennon@thebeatles.com",
        "shipping": null,
        "subscriber": 1,
        "date_purged": null
    }
},
{
    "model": "djstripe.product",
    "pk": 1,
    "fields": {
        "id": "prod_EYVbLlKQNb2S7i",
        "livemode": false,
        "created": "2019-02-19T02:43:40Z",
        "metadata": "{}",
        "description": "",
        "djstripe_created": "2019-02-19T02:43:43.545Z",
        "djstripe_updated": "2019-02-19T02:43:44.677Z",
        "name": "Producto 1",
        "type": "service",
        "active": true,
        "attributes": "[]",
        "caption": "",
        "deactivate_on": "[]",
        "images": "[]",
        "package_dimensions": null,
        "shippable": null,
        "url": "",
        "statement_descriptor": "",
        "unit_label": ""
    }
},
{
    "model": "djstripe.plan",
    "pk": 1,
    "fields": {
        "id": "plan_EYVb1KBs26uy5D",
        "livemode": false,
        "created": "2019-02-19T02:43:43Z",
        "metadata": "{}",
        "description": "",
        "djstripe_created": "2019-02-19T02:43:46.811Z",
        "djstripe_updated": "2019-02-19T02:43:46.811Z",
        "active": true,
        "aggregate_usage": "",
        "amount": "149.99",
        "billing_scheme": "per_unit",
        "currency": "eur",
        "interval": "month",
        "interval_count": 1,
        "nickname": "product_one",
        "product": 1,
        "tiers": null,
        "tiers_mode": "",
        "transform_usage": null,
        "trial_period_days": 7,
        "usage_type": "licensed",
        "name": "",
        "statement_descriptor": ""
    }
},
{
    "model": "djstripe.subscription",
    "pk": 1,
    "fields": {
        "id": "sub_EYW1cKc9wOVrzP",
        "livemode": false,
        "created": "2019-02-19T03:09:50Z",
        "metadata": null,
        "description": "",
        "djstripe_created": "2019-02-19T03:09:52.153Z",
        "djstripe_updated": "2019-02-19T03:10:05.449Z",
        "application_fee_percent": null,
        "billing": "charge_automatically",
        "billing_cycle_anchor": "2019-02-28T23:00:00Z",
        "cancel_at_period_end": false,
        "canceled_at": null,
        "current_period_end": "2019-02-28T23:00:00Z",
        "current_period_start": "2019-02-19T03:09:50Z",
        "customer": 1,
        "days_until_due": null,
        "ended_at": null,
        "plan": 1,
        "quantity": 1,
        "start": "2019-02-19T03:09:50Z",
        "status": "active",
        "tax_percent": "21.00",
        "trial_end": null,
        "trial_start": null
    }
}
]
